In [ ]:
import pandas as pd

In [122]:
# Sample data creation, Dataframe creation
datta = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Henry', 'Isabella', 'Jack',
             'Katherine', 'Liam', 'Mia', 'Noah', 'Olivia', 'Peter', 'Quinn', 'Rachel', 'Samuel', 'Taylor',
             'Uma', 'Victor', 'Wendy', 'Xavier', 'Yara', 'Zachary', 'Sophia', 'James', 'Luna', 'Ethan'],
    'Age': [60, 50, 27, 45, 32, 29, 38, 55, 24, 41, 
            33, 26, 31, 28, 35, 47, 22, 39, 52, 30, 
            36, 43, 25, 48, 23, 34, 31, 57, 20, 44],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami', 'Tokyo', 'Sydney', 'Berlin', 'Rome', 'Dubai',
             'Singapore', 'London', 'Manchester', 'Birmingham', 'Liverpool', 'Moscow', 'Vienna', 'Prague', 'Athens', 'Lisbon',
             'Cairo', 'Bangkok', 'Stockholm', 'Brussels', 'Oslo', 'Warsaw', 'Budapest', 'Dublin', 'Helsinki', 'Zurich'],
    'Country': ['USA', 'USA', 'USA', 'USA', 'USA', 'Japan', 'Australia', 'Germany', 'Italy', 'UAE',
                'Singapore', 'UK', 'UK', 'UK', 'UK', 'Russia', 'Austria', 'Czech Republic', 'Greece', 'Portugal',
                'Egypt', 'Thailand', 'Sweden', 'Belgium', 'Norway', 'Poland', 'Hungary', 'Ireland', 'Finland', 'Switzerland'],
'Address': ['123 Main St', '456 Oak St', '789 Pine St', '101 Maple St', '202 Birch St', 
            '303 Cedar St', '', '505 Spruce St', '606 Willow St', '707 Ash St',
            '808 Cherry St', '909 Poplar St', '111 Walnut St', '222 Chestnut St', '333 Magnolia St',
            '444 Redwood St', '555 Sequoia St', '666 Palm St', '777 Cypress St', '888 Fir St',
            '999 Hemlock St', '1110 Juniper St', '', '1312 Beech St', '1413 Sycamore St',
            '1514 Dogwood St', '1615 Hickory St', '1716 Locust St', '', '1918 Pecan St']
}

In [123]:
df = pd.DataFrame(datta) # DataFrame creation

In [124]:
print(df) # Display the DataFrame

         Name  Age         City         Country           Address
0       Alice   60     New York             USA       123 Main St
1         Bob   50  Los Angeles             USA        456 Oak St
2     Charlie   27      Chicago             USA       789 Pine St
3       David   45      Houston             USA      101 Maple St
4        Emma   32        Miami             USA      202 Birch St
5       Frank   29        Tokyo           Japan      303 Cedar St
6       Grace   38       Sydney       Australia
7       Henry   55       Berlin         Germany     505 Spruce St
8    Isabella   24         Rome           Italy     606 Willow St
9        Jack   41        Dubai             UAE        707 Ash St
10  Katherine   33    Singapore       Singapore     808 Cherry St
11       Liam   26       London              UK     909 Poplar St
12        Mia   31   Manchester              UK     111 Walnut St
13       Noah   28   Birmingham              UK   222 Chestnut St
14     Olivia   35    Liverpool              UK   333 Magnolia St
15      Peter   47       Moscow          Russia    444 Redwood St
16      Quinn   22       Vienna         Austria    555 Sequoia St
17     Rachel   39       Prague  Czech Republic       666 Palm St
18     Samuel   52       Athens          Greece    777 Cypress St
19     Taylor   30       Lisbon        Portugal        888 Fir St
20        Uma   36        Cairo           Egypt    999 Hemlock St
21     Victor   43      Bangkok        Thailand   1110 Juniper St
22      Wendy   25    Stockholm          Sweden
23     Xavier   48     Brussels         Belgium     1312 Beech St
24       Yara   23         Oslo          Norway  1413 Sycamore St
25    Zachary   34       Warsaw          Poland   1514 Dogwood St
26     Sophia   31     Budapest         Hungary   1615 Hickory St
27      James   57       Dublin         Ireland    1716 Locust St
28       Luna   20     Helsinki         Finland
29      Ethan   44       Zurich     Switzerland     1918 Pecan St

In [ ]:
df.head() # Display the first few rows of the DataFrame

In [ ]:
df.tail() # Display the last few rows of the DataFrame

In [ ]:
df.info() # Display summary information about the DataFrame

In [ ]:
df.describe() # Display statistical summary of numerical columns

In [ ]:
df.columns # Display column names

In [ ]:
df.index # Display index information

In [ ]:
df["country"] = df["Country"].str.lower() # Convert 'Country' column to lowercase and store in new 'country' column     
print(df) # Display the updated DataFrame

In [ ]:
df["Country"] # Access and display the 'Country' column

In [ ]:
df[["City", "Country"]] # Access and display multiple columns

In [32]:
len(df["Country"]) # Display the number of entries in the 'Country' column

3

In [ ]:
df.iloc[0] # Access the first row by index

In [ ]:
df.iloc[1][0]   # Access the first column of the second row

In [ ]:
df.iloc[1]["City"] # Access the 'City' column of the second row

In [ ]:
list(df.iloc[2]) # Access the third row and convert to list

In [ ]:
list(df.itertuples()) # Iterate over rows as namedtuples and convert to list

In [ ]:
df[df["Country"] == "USA"] # Filter rows where 'Country' is 'USA'

In [ ]:
df[(df["Country"] == "USA") & (df["Age"] >= 45)] # Filter rows where 'Country' is 'USA' and 'Age' is 45 or older

In [ ]:
df[(df["Country"] == "USA") | (df["Age"] < 30)] # Filter rows where 'Country' is 'USA' or 'Age' is less than 30

In [ ]:
df[(df["City"].str.contains("o") & df["Country"].str.endswith("A") & df["Name"].str.startswith("C"))] #

In [ ]:
df[(df["City"].str.contains("o") & df["Country"].isin(["USA", "UK", "Thailand"]))] # Filter rows where 'City' contains 'o' and 'Country' is either 'USA' or 'UK'

In [ ]:
df[(df["City"].str.contains("o") & ~df["Country"].isin(["USA", "UK", "Thailand"]))]

In [ ]:
df.iloc[10] #Name       Katherine
            # Age               33
            # City       Singapore
            # Country    Singapore
            # Name: 10, dtype: object

In [92]:
df.loc[df["Name"] == "Luna"] #28	Luna	20	Helsinki	Finland

    Name  Age      City Country
28  Luna   20  Helsinki  Canada

In [93]:
df.loc[df["Name"] == "Luna", "Country"] = "Canada" # Get the record who's name is Luna, and change the Country to Canada

In [ ]:
df.loc[df["Country"] == "USA", "City"] = "New York" # Get the Country filed, with value USA and change the city value to New York, for all of them

In [ ]:
df.loc[df["Country"] == "USA", "Country"] = "United States" # Get the Country filed, with value USA and change it to United States

In [100]:
df["Country"] = df["Country"].str.upper() # Convert 'Country' column to uppercase

In [107]:
df.drop(columns=["Address"], inplace=True) # Drop the 'Address' column

In [ ]:
df.drop(2) # Drop the row with index 2              #df.drop(2, inplace=True) # Drop the row with index 2

In [ ]:
df.dropna() # Drop rows with any missing values

In [ ]:
df.fillna("Unknown", inplace=True) # Fill missing values with 'Unknown'

In [130]:
df['Address'] = df['Address'].replace('', 'Unknown Address')

In [133]:
df.rename(columns={"Address": "Permanent_Address"}, inplace=True) # Rename 'Address' column to 'Permanent_Address'

In [154]:
df.rename(columns={"Permanent_Address": "Permanent_Address2"}, inplace=True) # Rename 'Permanent_Address' column to 'Permanent_Address2'

In [ ]:
df["Country"].value_counts() # Count occurrences of each unique value in 'Country' column

In [ ]:
df.groupby("Country").size() # Group by 'Country' and count occurrences